# Especificaci칩n de la frecuencia m치xima de operaci칩n
create_clock -name clk -period 7 [get_ports {*}]

# Establecer restricciones de tiempo para las se침ales de entrada
set_input_delay -clock clk -max 2 [get_ports a[*]]
set_input_delay -clock clk -max 2 [get_ports b[*]]
set_input_delay -clock clk -max 2 [get_ports op]
set_input_delay -clock clk -max 2 [get_ports start]

# Establecer restricciones de tiempo para la salida
set_output_delay -clock clk -max 2 [get_ports result]

